# Indexado I

In [2]:
# Los dataframes tienen un índice que nos sirve entre otras cosas para consultar el dataframe
import numpy as np
import pandas as pd

from pathlib import Path
data_path = Path('./data/')

In [3]:
dataset = pd.read_csv(data_path / 'dataset.csv', sep = ',')
dataset.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [5]:
# Queremos consultar aquellas observaciones cuya ciudad sea Dallas. Para ello primero vemos cuántos valores de ciudad hay, por si hubiese solo uno y ese fuese Dallas

dataset['City'].value_counts()

New York City      50307
Los Angeles        32173
Dallas             19707
Mountain View      14219
Austin             12292
Boston              8301
Washington D.C.     8120
San Diego           4881
Name: City, dtype: int64

In [10]:
# al ver que hay varios distintos, tenemos que hacer una consulta. Primero observamos que nos devuelve esto, una serie de true or false
dataset['City'] == "Dallas"

0          True
1          True
2          True
3          True
4          True
          ...
149995    False
149996    False
149997    False
149998    False
149999    False
Name: City, Length: 150000, dtype: bool

In [12]:
dallas_city = dataset[dataset['City'] == 'Dallas']
dallas_city
# lo que hacemos es que le estamos enviando el array de booleanos al dataset y lo guardamos en una variable

       Number    City  Gender  Age   Income Illness
0           1  Dallas    Male   41  40367.0      No
1           2  Dallas    Male   54  45084.0      No
2           3  Dallas    Male   42  52483.0      No
3           4  Dallas    Male   40  40941.0      No
4           5  Dallas    Male   46  50289.0      No
...       ...     ...     ...  ...      ...     ...
19702   19703  Dallas  Female   59  30021.0      No
19703   19704  Dallas    Male   33  34643.0      No
19704   19705  Dallas    Male   33  53190.0      No
19705   19706  Dallas    Male   37  54265.0      No
19706   19707  Dallas    Male   59  51265.0      No

[19707 rows x 6 columns]

In [13]:
# podemos filtrar por varios datos. Por ejemplo, por Dallas y por género femenino
dallas_female = dataset[(dataset['City']=='Dallas') & (dataset['Gender'] == 'Female')]
dallas_female.head()

    Number    City  Gender  Age   Income Illness
5        6  Dallas  Female   36  50786.0      No
6        7  Dallas  Female   32  33155.0      No
9       10  Dallas  Female   30  50082.0      No
10      11  Dallas  Female   48  41524.0     Yes
13      14  Dallas  Female   42  50894.0      No

### Loc e iloc métodos

In [14]:
# Nuestro dataset tiene un índice, y ese índice puede ser numerico o alfanumerico. 
dataset.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [16]:
dataset.loc[1]
# Nos devuelve un objeto con sus atributos, en la posición del índice que le hayamos indicado

Number           2
City        Dallas
Gender        Male
Age             54
Income     45084.0
Illness         No
Name: 1, dtype: object

In [17]:
# vamos a probar modificando el índice, para confundirlo. Le añadimos 10 posiciones al índice
dataset1 = dataset.set_index(np.arange(10, len(dataset)+10))
dataset1.head()

    Number    City Gender  Age   Income Illness
10       1  Dallas   Male   41  40367.0      No
11       2  Dallas   Male   54  45084.0      No
12       3  Dallas   Male   42  52483.0      No
13       4  Dallas   Male   40  40941.0      No
14       5  Dallas   Male   46  50289.0      No

In [18]:
dataset1.loc[1] # esto nos dará un error, porque no hay ningún índice en posición 1

KeyError: 1

In [19]:
dataset1.iloc[1]

Number           2
City        Dallas
Gender        Male
Age             54
Income     45084.0
Illness         No
Name: 11, dtype: object

In [20]:
# Con iloc estamos solventando este error, estamos diciendo que le da igual el valor de ese índice, que lo cuente de una forma natural desde 0.

In [22]:
# Con iloc y loc podemos consultar filas y columnas
dataset.loc[10, ['City', 'Age']]

City    Dallas
Age         48
Name: 10, dtype: object

In [31]:
dataset1.iloc[10, [1,3]] # Con iloc siempre funcionamos con posiciones y no con nombres

City    Dallas
Age         48
Name: 20, dtype: object

In [32]:
dataset.iat[0,1] # Idéntico al iloc, nos devolvería la fila 0 de la columna 1

'Dallas'

In [35]:
dataset.loc[1:3] # de la fila 1 a la 3. Podemos trabajar con slicing en todas sus propiedades

   Number    City Gender  Age   Income Illness
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No